config/Documents/ТоварныеОтчетыАптек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ТоварныеОтчетыАптек</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокАптеки</Name>
					<Comment>Статус документа в аптечном ПО</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусДокАптеки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомДокАптеки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДДокументаАптеки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияДокументаАптеки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДокументаАптеки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийАптеки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокНачПериодаАптеки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокКонПериодаАптеки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриходАптеки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходАптеки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокНачПериодаОфиса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокКонПериодаОфиса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриходОфиса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходОфиса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьРасхождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДвижения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИДДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДокументаАптеки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДокументаАптеки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроведенияАптеки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДокументаОфиса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДокументаОфиса</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроведенияОфиса</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакупБезНДСАптеки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакупБезНДСОфиса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма_0_Аптеки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма_10_Аптеки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма_18_Аптеки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма_0_Офиса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма_10_Офиса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма_18_Офиса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьРасхождение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

config/InformationRegisters/ОфисАптекаЦелевые.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОфисАптекаЦелевые</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КодАптеки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияФормата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторКодировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХМЛСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Блокировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияПакета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/Documents/ТоварныеОтчетыАптек/Ext/ObjectModule.bsl
Функция КорректировкаСпецСимволов(Значение)
	
	//Возврат Значение;
	
   Результат = СтрЗаменить(Значение, "&", "&amp;");
   Результат = СтрЗаменить(Результат, "<", "&lt;");
   Результат = СтрЗаменить(Результат, ">", "&gt;");
   Результат = СтрЗаменить(Результат, """", "&quot;");
   Результат = СтрЗаменить(Результат, "'", "&apos;");
   Результат = СтрЗаменить(Результат, "/", "&#x2F;");	
   Возврат Результат;
   
КонецФункции

Процедура ЗаписатьЭлементXML(ЗаписьXML, Имя, Значение) 
	
	//ЗаписьXML.ЗаписатьНачалоЭлемента(Имя);
	//ЗаписьXML.ЗаписатьТекст(Значение);
	//ЗаписьXML.ЗаписатьКонецЭлемента();
	Если Значение = "" Тогда
		ЗаписьXML.ДобавитьСтроку("<" + Имя + "/>");
	Иначе
		ЗаписьXML.ДобавитьСтроку("<" + Имя + ">" + Значение + "</" + Имя + ">");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьНачалоЭлемента(ЗаписьXML,Имя)
	
	ЗаписьXML.ДобавитьСтроку("<" + Имя + ">");
	
КонецПроцедуры

Процедура ЗаписатьКонецЭлемента(ЗаписьXML,Имя)
	
	ЗаписьXML.ДобавитьСтроку("</" + Имя + ">");
	
КонецПроцедуры

Процедура ВыгрузитьВАптеку() Экспорт
	
	
	ТХТ = "ВЫБРАТЬ
	      |	ТоварныеОтчетыАптекСостав.НомерСтроки,
	      |	ТоварныеОтчетыАптекСостав.ТипДокумента,
	      |	ТоварныеОтчетыАптекСостав.ВидДвижения,
	      |	ТоварныеОтчетыАптекСостав.ИДДокумента,
	      |	ТоварныеОтчетыАптекСостав.КодДокумента,
	      |	ТоварныеОтчетыАптекСостав.НомерДокументаАптеки,
	      |	ТоварныеОтчетыАптекСостав.ДатаДокументаАптеки,
	      |	ТоварныеОтчетыАптекСостав.ДатаПроведенияАптеки,
	      |	ТоварныеОтчетыАптекСостав.НомерДокументаОфиса,
	      |	ТоварныеОтчетыАптекСостав.ДатаДокументаОфиса,
	      |	ТоварныеОтчетыАптекСостав.ДатаПроведенияОфиса,
	      |	ТоварныеОтчетыАптекСостав.СуммаЗакупБезНДСАптеки,
	      |	ТоварныеОтчетыАптекСостав.СуммаЗакупБезНДСОфиса,
	      |	ТоварныеОтчетыАптекСостав.Сумма_0_Аптеки,
	      |	ТоварныеОтчетыАптекСостав.Сумма_10_Аптеки,
	      |	ТоварныеОтчетыАптекСостав.Сумма_18_Аптеки,
	      |	ТоварныеОтчетыАптекСостав.Сумма_0_Офиса,
	      |	ТоварныеОтчетыАптекСостав.Сумма_10_Офиса,
	      |	ТоварныеОтчетыАптекСостав.Сумма_18_Офиса,
	      |	ТоварныеОтчетыАптекСостав.Комментарий
	      |ИЗ
	      |	Документ.ТоварныеОтчетыАптек.Состав КАК ТоварныеОтчетыАптекСостав
	      |ГДЕ
	      |	ТоварныеОтчетыАптекСостав.Ссылка = &Ссылка
	      |	И ТоварныеОтчетыАптекСостав.СуммаЗакупБезНДСОфиса <> 0";
			Запрос = Новый Запрос;
			Запрос.Текст = ТХТ;
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			
			Результат				= Запрос.Выполнить();	   
			ВыборкаСтроки			= Результат.Выбрать();
			
			

	ЗаписьXML = Новый ТекстовыйДокумент;
	
	
	ЗаписьXML.ДобавитьСтроку("<?xml version=""1.0"" encoding=""WINDOWS-1251""?>");

	ЗаписьXML.ДобавитьСтроку("<document>"); 

	
	ЗаписатьЭлементXML(ЗаписьXML, "pack_type", "VERIFICATION"); 
	ЗаписатьЭлементXML(ЗаписьXML, "fmt_ver", "1"); 

		
		ЗаписьXML.ДобавитьСтроку("<hdr>");
			     ЗаписатьЭлементXML(ЗаписьXML, "id_doc_type", 	"305"); 
				 ЗаписатьЭлементXML(ЗаписьXML, "guid", ИДДокументаАптеки); 
				 ЗаписатьЭлементXML(ЗаписьXML, "period_start",					Формат(НачалоПериода,"ДФ=dd.MM.yyyy"));
				 ЗаписатьЭлементXML(ЗаписьXML, "period_end",					Формат(КонецПериода,"ДФ=dd.MM.yyyy"));
  				 ЗаписатьЭлементXML(ЗаписьXML, "sum_pur_wo_vat_start",			Формат(ОстатокНачПериодаАптеки,"ЧДЦ=2; ЧРД=.; ЧН=0; ЧГ=0"));
  				 ЗаписатьЭлементXML(ЗаписьXML, "sum_pur_wo_vat_start_office",	Формат(ОстатокНачПериодаОфиса,"ЧДЦ=2; ЧРД=.; ЧН=0; ЧГ=0"));
  				 ЗаписатьЭлементXML(ЗаписьXML, "sum_pur_wo_vat_debit"	,		Формат(ПриходАптеки,"ЧДЦ=2; ЧРД=.; ЧН=0; ЧГ=0"));
  				 ЗаписатьЭлементXML(ЗаписьXML, "sum_pur_wo_vat_debit_office",	Формат(ПриходОфиса,"ЧДЦ=2; ЧРД=.; ЧН=0; ЧГ=0"));
  				 ЗаписатьЭлементXML(ЗаписьXML, "sum_pur_wo_vat_credit",			Формат(РасходАптеки,"ЧДЦ=2; ЧРД=.; ЧН=0; ЧГ=0"));
  				 ЗаписатьЭлементXML(ЗаписьXML, "sum_pur_wo_vat_credit_office",	Формат(РасходОфиса,"ЧДЦ=2; ЧРД=.; ЧН=0; ЧГ=0"));
  				 ЗаписатьЭлементXML(ЗаписьXML, "sum_pur_wo_vat_end",			Формат(ОстатокКонПериодаАптеки,"ЧДЦ=2; ЧРД=.; ЧН=0; ЧГ=0"));
  				 ЗаписатьЭлементXML(ЗаписьXML, "sum_pur_wo_vat_end_office",		Формат(ОстатокКонПериодаОфиса,"ЧДЦ=2; ЧРД=.; ЧН=0; ЧГ=0"));
				 ЗаписатьЭлементXML(ЗаписьXML, "status",	"5"); 
	  	ЗаписьXML.ДобавитьСтроку("</hdr>"); //конец записи секции  "hdr"
		
		ВыборкаСтроки.Сбросить();
		ЗаписьXML.ДобавитьСтроку("<str>");
		Пока ВыборкаСтроки.Следующий() Цикл
			ЗаписьXML.ДобавитьСтроку("<row>");
			ЗаписатьЭлементXML(ЗаписьXML, "id_type",				Формат(ВыборкаСтроки.ВидДвижения,"ЧДЦ=0; ЧРД=.; ЧН=0; ЧГ=0"));
			ЗаписатьЭлементXML(ЗаписьXML, "id_doc_type",			Формат(ВыборкаСтроки.ТипДокумента,"ЧДЦ=0; ЧРД=.; ЧН=0; ЧГ=0"));
			ЗаписатьЭлементXML(ЗаписьXML, "id_doc",					Формат(ВыборкаСтроки.КодДокумента,"ЧДЦ=0; ЧРД=.; ЧН=0; ЧГ=0"));
			ЗаписатьЭлементXML(ЗаписьXML, "guid",					КорректировкаСпецСимволов(ВыборкаСтроки.ИДДокумента));
			//ЗаписатьЭлементXML(ЗаписьXML, "ndoc",					КорректировкаСпецСимволов(ВыборкаСтроки.НомерДокументаАптеки));
			ЗаписатьЭлементXML(ЗаписьXML, "ndoc_office",			КорректировкаСпецСимволов(ВыборкаСтроки.НомерДокументаОфиса));
			//ЗаписатьЭлементXML(ЗаписьXML, "ddoc",					Формат(ВыборкаСтроки.ДатаДокументаАптеки,"ДФ=dd.MM.yyyy"));
			ЗаписатьЭлементXML(ЗаписьXML, "ddoc_office",			Формат(ВыборкаСтроки.ДатаДокументаОфиса,"ДФ=dd.MM.yyyy"));
			//ЗаписатьЭлементXML(ЗаписьXML, "date_accept",			Формат(ВыборкаСтроки.ДатаПроведенияАптеки,"ДФ=dd.MM.yyyy"));
			ЗаписатьЭлементXML(ЗаписьXML, "date_accept_office",		Формат(ВыборкаСтроки.ДатаПроведенияОфиса,"ДФ=dd.MM.yyyy"));
			//ЗаписатьЭлементXML(ЗаписьXML, "sum_pur_wo_vat",			Формат(ВыборкаСтроки.СуммаЗакупБезНДСАптеки,"ЧДЦ=2; ЧРД=.; ЧН=0; ЧГ=0"));
			ЗаписатьЭлементXML(ЗаписьXML, "sum_pur_wo_vat_office",	Формат(ВыборкаСтроки.СуммаЗакупБезНДСОфиса,"ЧДЦ=2; ЧРД=.; ЧН=0; ЧГ=0"));
			//ЗаписатьЭлементXML(ЗаписьXML, "sum_pur_wo_vat_0",		Формат(ВыборкаСтроки.Сумма_0_Аптеки,"ЧДЦ=2; ЧРД=.; ЧН=0; ЧГ=0"));
			ЗаписатьЭлементXML(ЗаписьXML, "sum_pur_wo_vat_0_office",Формат(ВыборкаСтроки.Сумма_0_Офиса,"ЧДЦ=2; ЧРД=.; ЧН=0; ЧГ=0"));
			//ЗаписатьЭлементXML(ЗаписьXML, "sum_pur_wo_vat_10",		Формат(ВыборкаСтроки.Сумма_10_Аптеки,"ЧДЦ=2; ЧРД=.; ЧН=0; ЧГ=0"));
			ЗаписатьЭлементXML(ЗаписьXML, "sum_pur_wo_vat_10_office",Формат(ВыборкаСтроки.Сумма_10_Офиса,"ЧДЦ=2; ЧРД=.; ЧН=0; ЧГ=0"));
			//ЗаписатьЭлементXML(ЗаписьXML, "sum_pur_wo_vat_18",		Формат(ВыборкаСтроки.Сумма_18_Аптеки,"ЧДЦ=2; ЧРД=.; ЧН=0; ЧГ=0"));
			ЗаписатьЭлементXML(ЗаписьXML, "sum_pur_wo_vat_18_office",Формат(ВыборкаСтроки.Сумма_18_Офиса,"ЧДЦ=2; ЧРД=.; ЧН=0; ЧГ=0"));
			//ЗаписатьЭлементXML(ЗаписьXML, "dsc_dep",				КорректировкаСпецСимволов(ВыборкаСтроки.Комментарий));
			ЗаписьXML.ДобавитьСтроку("</row>");
		КонецЦикла;
		ЗаписьXML.ДобавитьСтроку("</str>"); //конец записи секции  "str"
	
	ЗаписьXML.ДобавитьСтроку("</document>"); //конец записи секции  "document"
	ВесьТекст = ЗаписьXML.ПолучитьТекст();
	ЗаписьXML.Очистить();
	ЗаписьXML = Неопределено;
	
	КодСклада = Склад.Код;
	КодСчетчика = ОМ_ТСО.ПолучитьКодСчетчика("ОбменАптекаОфисЦелевые");
	Если КодСчетчика = -1 Тогда
		КодСчетчика = ОМ_ТСО.ПолучитьКодСчетчика("ОбменАптекаОфисЦелевые");
		Если КодСчетчика = -1 Тогда
			Возврат;	
		КонецЕсли;
	КонецЕсли;
	
	//к = Число("раздватри");
	
	МЗ = РегистрыСведений.ОфисАптекаЦелевые.СоздатьМенеджерЗаписи();
	МЗ.Код = КодСчетчика;
	МЗ.КодАптеки = КодСклада;
	МЗ.ТипУпаковки = "VERIFICATION";
	МЗ.Приоритет = 1;
	МЗ.ВерсияФормата = 1;
	МЗ.ИмяФайла = "verification_" + СокрЛП(Формат(КодСклада,"ЧГ=0")) + "_" + СокрЛП(Формат(Номер,"ЧГ=0")) + "_" + Формат(Дата,"ДФ=dd.MM.yyyy") +".xml";
	МЗ.ИдентификаторКодировки = 1;
	МЗ.ХМЛСтрока = ВесьТекст;
	МЗ.ИдентификаторДокумента = ИДДокументаАптеки;
	МЗ.Записать();	
	
	ОбщегоНазначения.ЗаписатьИсториюИзмененияДокумента(Ссылка,"Выгружен",ПараметрыСеанса.ТекущийСотр,"Выгружен в аптеку");	
	
	
КонецПроцедуры

Процедура СверитьТоварныйОтчет(Выборка)   Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА Выборка.Регистратор ССЫЛКА Документ.УЗ_ВводОстатков
	               |			ТОГДА 200
	               |		КОГДА Выборка.Регистратор ССЫЛКА Документ.УЗ_ПоступлениеТовара
	               |			ТОГДА 201
	               |		КОГДА Выборка.Регистратор ССЫЛКА Документ.УЗ_Торг2
	               |			ТОГДА 202
	               |		КОГДА Выборка.Регистратор ССЫЛКА Документ.УЗ_ВозвратОтПокупателя
	               |			ТОГДА 204
	               |		КОГДА Выборка.Регистратор ССЫЛКА Документ.УЗ_Перемещение
	               |				И Выборка.id_type = 1
	               |			ТОГДА 205
	               |		КОГДА Выборка.Регистратор ССЫЛКА Документ.УЗ_Перемещение
	               |				И Выборка.id_type = -1
	               |			ТОГДА 206
	               |		КОГДА Выборка.Регистратор ССЫЛКА Документ.ПереоценкаПоКачеству
	               |			ТОГДА 207
	               |		КОГДА Выборка.Регистратор ССЫЛКА Документ.УЗ_ВозвратТовара
	               |			ТОГДА 209
	               |		КОГДА Выборка.Регистратор ССЫЛКА Документ.УЗ_МелкооптоваяРеализация
	               |			ТОГДА 211
	               |		КОГДА Выборка.Регистратор ССЫЛКА Документ.УЗ_Списание
	               |			ТОГДА 212
	               |		КОГДА Выборка.Регистратор ССЫЛКА Документ.УЗ_АрбитражПомещение
	               |			ТОГДА 213
	               |		КОГДА Выборка.Регистратор ССЫЛКА Документ.УЗ_АрбитражИзъятие
	               |			ТОГДА 214
	               |		КОГДА Выборка.Регистратор ССЫЛКА Документ.УЗ_Инвентаризация
	               |			ТОГДА 215
	               |		КОГДА Выборка.Регистратор ССЫЛКА Документ.УЗ_Разбраковка
	               |			ТОГДА 216
	               |		КОГДА Выборка.Регистратор ССЫЛКА Документ.УЗ_КорректировкаНедовоза
	               |			ТОГДА 217
	               |		КОГДА Выборка.Регистратор ССЫЛКА Документ.УЗ_Трансформация
	               |			ТОГДА 218
	               |		КОГДА Выборка.Регистратор ССЫЛКА Документ.УЗ_РеализацияККМ
	               |			ТОГДА 300
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ТипДокумента,
	               |	Выборка.id_type,
	               |	Выборка.Период КАК ДатаПроведенияОфиса,
	               |	Выборка.Регистратор.Дата КАК ДатаДокументаОфиса,
	               |	ВЫБОР
	               |		КОГДА Выборка.Регистратор ССЫЛКА Документ.УЗ_РеализацияККМ
	               |			ТОГДА Выборка.Регистратор.НомерККМ + ""/"" + Выборка.Регистратор.НомерСмены
	               |		КОГДА Выборка.Регистратор ССЫЛКА Документ.УЗ_ПоступлениеТовара
	               |			ТОГДА Выборка.Регистратор.Номер
	               |		КОГДА Выборка.Регистратор ССЫЛКА Документ.УЗ_ВводОстатков
	               |			ТОГДА Выборка.Регистратор.Номер
	               |		КОГДА Выборка.Регистратор ССЫЛКА Документ.УЗ_Перемещение
	               |				И Выборка.id_type = 1
	               |			ТОГДА Выборка.Регистратор.Номер
	               |		КОГДА Выборка.Регистратор ССЫЛКА Документ.УЗ_Перемещение
	               |				И Выборка.id_type = -1
	               |			ТОГДА Выборка.Регистратор.НомДокАптекиОтправителя
	               |		ИНАЧЕ Выборка.Регистратор.НомДокАптеки
	               |	КОНЕЦ КАК НомерДокументаОфиса,
	               |	ВЫБОР
	               |		КОГДА Выборка.Регистратор ССЫЛКА Документ.УЗ_Перемещение
	               |				И Выборка.id_type = 1
	               |			ТОГДА Выборка.Регистратор.ИДДокументаАптекиПолучатель
	               |		КОГДА Выборка.Регистратор ССЫЛКА Документ.УЗ_Перемещение
	               |				И Выборка.id_type = -1
	               |			ТОГДА Выборка.Регистратор.ИДДокументаАптекиОтправитель
	               |		КОГДА Выборка.Регистратор ССЫЛКА Документ.УЗ_РеализацияККМ
	               |			ТОГДА Выборка.Регистратор.GuidСмены
	               |		ИНАЧЕ Выборка.Регистратор.ИДДокументаАптеки
	               |	КОНЕЦ КАК ИДДокумента,
	               |	Выборка.СуммаЗакупБезНДС,
	               |	Выборка.sum_pur_wo_vat_0,
	               |	Выборка.sum_pur_wo_vat_10,
	               |	Выборка.sum_pur_wo_vat_18
	               |ПОМЕСТИТЬ ВТСверка
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		УЗ_ТоварныйОтчет.Период КАК Период,
	               |		УЗ_ТоварныйОтчет.Регистратор КАК Регистратор,
	               |		ВЫБОР
	               |			КОГДА УЗ_ТоварныйОтчет.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |				ТОГДА 1
	               |			ИНАЧЕ -1
	               |		КОНЕЦ КАК id_type,
	               |		СУММА(УЗ_ТоварныйОтчет.СуммаЗакупБезНДС) КАК СуммаЗакупБезНДС,
	               |		СУММА(ВЫБОР
	               |				КОГДА УЗ_ТоварныйОтчет.СтавкаНДС = 0
	               |					ТОГДА УЗ_ТоварныйОтчет.СуммаЗакупБезНДС
	               |			КОНЕЦ) КАК sum_pur_wo_vat_0,
	               |		СУММА(ВЫБОР
	               |				КОГДА УЗ_ТоварныйОтчет.СтавкаНДС = 10
	               |					ТОГДА УЗ_ТоварныйОтчет.СуммаЗакупБезНДС
	               |			КОНЕЦ) КАК sum_pur_wo_vat_10,
	               |		СУММА(ВЫБОР
				   // НДС20/18
	               |				КОГДА УЗ_ТоварныйОтчет.СтавкаНДС = 18 или УЗ_ТоварныйОтчет.СтавкаНДС = 20 
	               |					ТОГДА УЗ_ТоварныйОтчет.СуммаЗакупБезНДС
	               |			КОНЕЦ) КАК sum_pur_wo_vat_18
	               |	ИЗ
	               |		РегистрНакопления.УЗ_ТоварныйОтчет КАК УЗ_ТоварныйОтчет
	               |	ГДЕ
	               |		УЗ_ТоварныйОтчет.Период МЕЖДУ &НачПериода И &КонПериода
	               |		И УЗ_ТоварныйОтчет.СкладКод = &СкладКод
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		УЗ_ТоварныйОтчет.Период,
	               |		УЗ_ТоварныйОтчет.Регистратор,
	               |		ВЫБОР
	               |			КОГДА УЗ_ТоварныйОтчет.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |				ТОГДА 1
	               |			ИНАЧЕ -1
	               |		КОНЕЦ
	               |	
	               |	ОБЪЕДИНИТЬ
	               |	
	               |	ВЫБРАТЬ
	               |		Арбитраж.Период,
	               |		Арбитраж.Регистратор,
	               |		ВЫБОР
	               |			КОГДА Арбитраж.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |				ТОГДА 1
	               |			ИНАЧЕ -1
	               |		КОНЕЦ,
	               |		СУММА(Арбитраж.СуммаЗакупБезНДС),
	               |		СУММА(ВЫБОР
	               |				КОГДА Арбитраж.СтавкаНДСЗакуп = 0
	               |					ТОГДА Арбитраж.СуммаЗакупБезНДС
	               |			КОНЕЦ),
	               |		СУММА(ВЫБОР
	               |				КОГДА Арбитраж.СтавкаНДСЗакуп = 10
	               |					ТОГДА Арбитраж.СуммаЗакупБезНДС
	               |			КОНЕЦ),
	               |		СУММА(ВЫБОР
				   // НДС20/18
	               |				КОГДА Арбитраж.СтавкаНДСЗакуп = 18 или  Арбитраж.СтавкаНДСЗакуп = 20
	               |					ТОГДА Арбитраж.СуммаЗакупБезНДС
	               |			КОНЕЦ)
	               |	ИЗ
	               |		РегистрНакопления.УЗ_ПартииАрбитраж КАК Арбитраж
	               |	ГДЕ
	               |		Арбитраж.Период МЕЖДУ &НачПериода И &КонПериода
	               |		И Арбитраж.СкладКод = &СкладКод  И НЕ Арбитраж.Регистратор ССЫЛКА Документ.УЗ_Списание
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		Арбитраж.Период,
	               |		Арбитраж.Регистратор,
	               |		ВЫБОР
	               |			КОГДА Арбитраж.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |				ТОГДА 1
	               |			ИНАЧЕ -1
	               |		КОНЕЦ
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		Арбитраж.Период,
	               |		Арбитраж.Регистратор,
	               |		ВЫБОР
	               |			КОГДА Арбитраж.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |				ТОГДА 1
	               |			ИНАЧЕ -1
	               |		КОНЕЦ,
	               |		СУММА(Арбитраж.СуммаЗакупБезНДС),
	               |		СУММА(ВЫБОР
	               |				КОГДА Арбитраж.СтавкаНДСЗакуп = 0
	               |					ТОГДА Арбитраж.СуммаЗакупБезНДС
	               |			КОНЕЦ),
	               |		СУММА(ВЫБОР
	               |				КОГДА Арбитраж.СтавкаНДСЗакуп = 10
	               |					ТОГДА Арбитраж.СуммаЗакупБезНДС
	               |			КОНЕЦ),
	               |		СУММА(ВЫБОР
				   // НДС20/18
	               |				КОГДА Арбитраж.СтавкаНДСЗакуп = 18 или Арбитраж.СтавкаНДСЗакуп = 20
	               |					ТОГДА Арбитраж.СуммаЗакупБезНДС
	               |			КОНЕЦ)
	               |	ИЗ
	               |		РегистрНакопления.УЗ_Партии КАК Арбитраж
	               |	ГДЕ
	               |		Арбитраж.Период МЕЖДУ &НачПериода И &КонПериода
	               |		И Арбитраж.СкладКод = &СкладКод
	               |		И (Арбитраж.Регистратор ССЫЛКА Документ.УЗ_АрбитражПомещение
	               |				ИЛИ Арбитраж.Регистратор ССЫЛКА Документ.УЗ_АрбитражИзъятие)
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		Арбитраж.Период,
	               |		Арбитраж.Регистратор,
	               |		ВЫБОР
	               |			КОГДА Арбитраж.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |				ТОГДА 1
	               |			ИНАЧЕ -1
	               |		КОНЕЦ) КАК Выборка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Рез.ТипДокумента,
	               |	Рез.ВидДвижения,
	               |	Рез.ИДДокумента,
	               |	СУММА(Рез.КодДокумента) КАК КодДокумента,
	               |	МАКСИМУМ(Рез.НомерДокументаАптеки) КАК НомерДокументаАптеки,
	               |	МАКСИМУМ(Рез.ДатаДокументаАптеки) КАК ДатаДокументаАптеки,
	               |	МАКСИМУМ(Рез.ДатаПроведенияАптеки) КАК ДатаПроведенияАптеки,
	               |	СУММА(Рез.СуммаЗакупБезНДСАптеки) КАК СуммаЗакупБезНДСАптеки,
	               |	СУММА(Рез.Сумма_0_Аптеки) КАК Сумма_0_Аптеки,
	               |	СУММА(Рез.Сумма_10_Аптеки) КАК Сумма_10_Аптеки,
	               |	СУММА(Рез.Сумма_18_Аптеки) КАК Сумма_18_Аптеки,
	               |	МАКСИМУМ(Рез.НомерДокументаОфиса) КАК НомерДокументаОфиса,
	               |	МАКСИМУМ(Рез.ДатаДокументаОфиса) КАК ДатаДокументаОфиса,
	               |	МАКСИМУМ(Рез.ДатаПроведенияОфиса) КАК ДатаПроведенияОфиса,
	               |	СУММА(Рез.СуммаЗакупБезНДСОфиса) КАК СуммаЗакупБезНДСОфиса,
	               |	СУММА(Рез.Сумма_0_Офиса) КАК Сумма_0_Офиса,
	               |	СУММА(Рез.Сумма_10_Офиса) КАК Сумма_10_Офиса,
	               |	СУММА(Рез.Сумма_18_Офиса) КАК Сумма_18_Офиса,
	               |	МАКСИМУМ(Рез.Комментарий) КАК Комментарий
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ТоварныеОтчетыАптекСостав.ТипДокумента КАК ТипДокумента,
	               |		ТоварныеОтчетыАптекСостав.ВидДвижения КАК ВидДвижения,
	               |		ТоварныеОтчетыАптекСостав.ИДДокумента КАК ИДДокумента,
	               |		ТоварныеОтчетыАптекСостав.КодДокумента КАК КодДокумента,
	               |		ТоварныеОтчетыАптекСостав.НомерДокументаАптеки КАК НомерДокументаАптеки,
	               |		ТоварныеОтчетыАптекСостав.ДатаДокументаАптеки КАК ДатаДокументаАптеки,
	               |		ТоварныеОтчетыАптекСостав.ДатаПроведенияАптеки КАК ДатаПроведенияАптеки,
	               |		ТоварныеОтчетыАптекСостав.СуммаЗакупБезНДСАптеки КАК СуммаЗакупБезНДСАптеки,
	               |		ТоварныеОтчетыАптекСостав.Сумма_0_Аптеки КАК Сумма_0_Аптеки,
	               |		ТоварныеОтчетыАптекСостав.Сумма_10_Аптеки КАК Сумма_10_Аптеки,
	               |		ТоварныеОтчетыАптекСостав.Сумма_18_Аптеки КАК Сумма_18_Аптеки,
	               |		0 КАК НомерДокументаОфиса,
	               |		ДАТАВРЕМЯ(1, 1, 1) КАК ДатаДокументаОфиса,
	               |		ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПроведенияОфиса,
	               |		0 КАК СуммаЗакупБезНДСОфиса,
	               |		0 КАК Сумма_0_Офиса,
	               |		0 КАК Сумма_10_Офиса,
	               |		0 КАК Сумма_18_Офиса,
	               |		ТоварныеОтчетыАптекСостав.Комментарий КАК Комментарий
	               |	ИЗ
	               |		Документ.ТоварныеОтчетыАптек.Состав КАК ТоварныеОтчетыАптекСостав
	               |	ГДЕ
	               |		ТоварныеОтчетыАптекСостав.Ссылка = &Документ
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВтСверка.ТипДокумента,
	               |		ВтСверка.id_type,
	               |		ВтСверка.ИДДокумента,
	               |		0,
	               |		"""",
	               |		ДАТАВРЕМЯ(1, 1, 1),
	               |		ДАТАВРЕМЯ(1, 1, 1),
	               |		0,
	               |		0,
	               |		0,
	               |		0,
	               |		ВтСверка.НомерДокументаОфиса,
	               |		ВтСверка.ДатаДокументаОфиса,
	               |		ВтСверка.ДатаПроведенияОфиса,
	               |		ВтСверка.СуммаЗакупБезНДС,
	               |		ВтСверка.sum_pur_wo_vat_0,
	               |		ВтСверка.sum_pur_wo_vat_10,
	               |		ВтСверка.sum_pur_wo_vat_18,
	               |		""""
	               |	ИЗ
	               |		ВТСверка КАК ВтСверка) КАК Рез
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Рез.ТипДокумента,
	               |	Рез.ВидДвижения,
	               |	Рез.ИДДокумента
	               |;                                                         	
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТСверка";
				   
		Запрос.УстановитьПараметр("СкладКод",Склад.Код);
		Запрос.УстановитьПараметр("Документ",Ссылка);
		Запрос.УстановитьПараметр("НачПериода",НачалоДня(НачалоПериода));
		Запрос.УстановитьПараметр("КонПериода",КонецДня(КонецПериода));
		Рез = Запрос.Выполнить().Выгрузить();
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТО.СуммаЗакупБезНДСНачальныйОстаток как ОстатокНачПериодаОфиса,
		               |	ТО.СуммаЗакупБезНДСПриход как ПриходОфиса,
		               |	ТО.СуммаЗакупБезНДСРасход как РасходОфиса,
		               |	ТО.СуммаЗакупБезНДСКонечныйОстаток как ОстатокКонПериодаОфиса
		               |ИЗ
		               |	РегистрНакопления.УЗ_ТоварныйОтчет.ОстаткиИОбороты(&НачПериода, &КонПериода, , ДвиженияИГраницыПериода, СкладКод = &СкладКод) КАК ТО";
					   
		ВыборкаЗапроса = Запрос.Выполнить().Выбрать();		
		ВыборкаЗапроса.Следующий();
		
		ОстатокНачПериодаОфиса = ВыборкаЗапроса.ОстатокНачПериодаОфиса;
		ПриходОфиса = ВыборкаЗапроса.ПриходОфиса;
		РасходОфиса = ВыборкаЗапроса.РасходОфиса;
		ОстатокКонПериодаОфиса = ВыборкаЗапроса.ОстатокКонПериодаОфиса;
		Состав.Загрузить(Рез);
		Записать(РежимЗаписиДокумента.Запись);
		ОбщегоНазначения.ЗаписатьИсториюИзмененияДокумента(Ссылка,"Запись",ПараметрыСеанса.ТекущийСотр,"Сверка данных");
	
	КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДатаПоследнегоИзменения = ТекущаяДата();
	
	ЕстьРасхождения = Ложь;
	Для каждого стр из Состав Цикл
		Если стр.СуммаЗакупБезНДСАптеки <> стр.СуммаЗакупБезНДСОфиса Тогда
			ЕстьРасхождения = Истина;
			стр.ЕстьРасхождение = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ОстатокКонПериодаАптеки = ОстатокКонПериодаОфиса Тогда
		ЕстьРасхождения = Ложь;
	Иначе 
		ЕстьРасхождения = Истина;
	КонецЕсли;
	
КонецПроцедуры
